app/views/courses/credit.html.erb

                    <% if grade.grade != nil %>
                      <% get_course = Course.find_by_id(grade.course_id) %>
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 16]]