app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("name", "course_type", "teaching_type", "exam_type", "credit", "limit_num", "class_room", "course_time", "course_week", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def open
    @course=Course.find_by_id(params[:id])
    @course.update_attributes(open: true)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2017-11-15 02:39:09.114227"], ["id", 1]]

  def list
    #UserMailer.password_reset.deliver_now
    #-------QiaoCode--------
    #所有可以选择的课程
    @course=Course.where(:open=>true)
    #除去已经选过的课程，留下将要选择的可选的课程
    @course=@course-current_user.courses
    tmp=[]
    @course.each do |course|
---
SELECT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def downloadcsv
    @course = current_user.courses.order(:course_code)
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  ORDER BY "courses"."course_code" ASC  [["user_id", 36]]

  def select
    @course=Course.find_by_id(params[:id])
    #处理冲突信息
    tmp=[]
    current_user.courses.each do |course|
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def quit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

  def credit
      @course=current_user.teaching_courses if teacher_logged_in?
      @course=current_user.courses if student_logged_in?
      tmp = []
      @course.each do |course|
        @current_user.grades.each do |grade|
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 37]]
SELECT "grades".* FROM "grades" WHERE "grades"."user_id" = $1  [["user_id", 37]]