app/controllers/grades_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 21]]
---
  def index
    if teacher_logged_in?
      @course=Course.find_by_id(params[:course_id])

SELECT  "grades".* FROM "grades" WHERE "grades"."id" = $1 LIMIT 1  [["id", 1236]]
UPDATE "grades" SET "evaluate_score" = $1, "class_score" = $2, "homework_score" = $3, "difficulty_score" = $4, "harvest_score" = $5, "updated_at" = $6 WHERE "grades"."id" = $7  [["evaluate_score", 3], ["class_score", 2], ["homework_score", 2], ["difficulty_score", 2], ["harvest_score", 2], ["updated_at", "2018-01-05 07:26:31.093962"], ["id", 1236]]
---
    def update_sec
      #debugger
      #flash={:info => "更新成功"}
      @grade=Grade.find_by_id(params[:id])
      if @grade.update_attributes(evaluate_params)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 16]]
---
    def evaluate
      if teacher_logged_in?
        @course=Course.find_by_id(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 16]]
---
    def show_eva
      @course=Course.find_by_id(params[:course_id])