app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "major", "department", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    #UserMailer.send_email.deliver_now
    @user=User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 36]]

  def update
    @user = User.find_by_id(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 36]]
UPDATE "users" SET "degree" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["degree", "博士"], ["updated_at", "2018-01-08 02:09:38.365417"], ["id", 36]]